RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Inc/stm32u5xx_ll_bus.h
/** @defgroup BUS_LL_EF_S2DAMR S2DAMR
  * @{
  */

/**
  * @brief  Enable SRDAMR peripheral clocks in autonomous mode
  * @rmtoll S2DAMR   SPI3AMEN      LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   LPUART1AMEN   LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   I2C3AMEN      LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   LPTIM1AMEN    LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   LPTIM3AMEN    LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   LPTIM4AMEN    LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   OPAMPAMEN     LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   COMPAMEN      LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   VREFAMEN      LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   VREFRST       LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   RTCAPBAMEN    LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   ADC4AMEN      LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   LPGPIO1AMEN   LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   DAC1AMEN      LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   LPDMA1AMEN    LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   ADF1AMEN      LL_SRDAMR_GRP1_EnableAutonomousClock\n
  *         S2DAMR   SRAM4AMEN     LL_SRDAMR_GRP1_EnableAutonomousClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_ALL
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_SPI3AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPUART1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_I2C3AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPTIM1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPTIM3AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPTIM4AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_OPAMPAMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_COMPAMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_VREFAMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_RTCAPBAMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_ADC4AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPGPIO1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_DAC1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPDMA1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_ADF1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_SRAM4AMEN
   * @retval None
  */
__STATIC_INLINE void LL_SRDAMR_GRP1_EnableAutonomousClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->SRDAMR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->SRDAMR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if S2DAMR peripheral clock is enabled or not
  * @rmtoll S2DAMR   SPI3AMEN      LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   LPUART1AMEN   LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   I2C3AMEN      LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   LPTIM1AMEN    LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   LPTIM3AMEN    LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   LPTIM4AMEN    LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   OPAMPAMEN     LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   COMPAMEN      LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   VREFAMEN      LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   VREFRST       LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   RTCAPBAMEN    LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   ADC4AMEN      LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   LPGPIO1AMEN   LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   DAC1AMEN      LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   LPDMA1AMEN    LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   ADF1AMEN      LL_SRDAMR_GRP1_IsEnabledAutonomousClock\n
  *         S2DAMR   SRAM4AMEN     LL_SRDAMR_GRP1_IsEnabledAutonomousClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_ALL
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_SPI3AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPUART1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_I2C3AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPTIM1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPTIM3AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPTIM4AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_OPAMPAMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_COMPAMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_VREFAMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_RTCAPBAMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_ADC4AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPGPIO1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_DAC1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPDMA1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_ADF1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_SRAM4AMEN
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SRDAMR_GRP1_IsEnabledAutonomousClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->SRDAMR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable S2DAMR peripheral clocks in Sleep and Stop modes
  * @rmtoll S2DAMR   SPI3AMEN      LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   LPUART1AMEN   LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   I2C3AMEN      LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   LPTIM1AMEN    LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   LPTIM3AMEN    LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   LPTIM4AMEN    LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   OPAMPAMEN     LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   COMPAMEN      LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   VREFAMEN      LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   VREFRST       LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   RTCAPBAMEN    LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   ADC4AMEN      LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   LPGPIO1AMEN   LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   DAC1AMEN      LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   LPDMA1AMEN    LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   ADF1AMEN      LL_SRDAMR_GRP1_DisableAutonomousClock\n
  *         S2DAMR   SRAM4AMEN     LL_SRDAMR_GRP1_DisableAutonomousClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_ALL
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_SPI3AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPUART1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_I2C3AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPTIM1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPTIM3AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPTIM4AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_OPAMPAMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_COMPAMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_VREFAMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_RTCAPBAMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_ADC4AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPGPIO1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_DAC1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_LPDMA1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_ADF1AMEN
  *         @arg @ref LL_SRDAMR_GRP1_PERIPH_SRAM4AMEN
  * @retval None
  */
__STATIC_INLINE void LL_SRDAMR_GRP1_DisableAutonomousClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->SRDAMR, Periphs);
}
/**
  * @}
  */

/**
  * @}
  */
#endif /* defined(RCC) */

/**
  * @}
  */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32U5xx_LL_BUS_H */
